package main.kotlin.lessons.lesson24

//Напиши функцию, которая принимает другую функцию без аргументов и возвращаемого значения.
fun ex1 (fnctn: () -> Unit) {

}

//Напиши функцию, принимающую функцию с одним аргументом типа Int и возвращающую String.
fun ex2 (fnctn: (Int) -> String) {

}

//Напиши функцию, принимающую лямбда-выражение с контекстом типа Int и возвращающее Unit.
fun ex3 (fnctn: Int.() -> Unit) {}

//Напиши функцию, которая принимает функцию с двумя аргументами типа Double и возвращает Boolean.
fun ex4(fnctn: (Double, Double) -> Boolean) {}

//Напиши функцию, которая принимает функцию с одним аргументом-дженериком и возвращает список с nullable дженериком.
fun<T> ex5(fnctn: (T) -> List<T?>) {}

//Напиши функцию, принимающую функцию с аргументом типа String и возвращающую другую функцию, принимающую Int и возвращающую Boolean.
fun ex6 (fnctn: String): (Int) -> Boolean {
    return { true }
}