package main.kotlin.lessons.lesson06.homework

//fun main () {
//    monthCount(4)
//    DogAgeCount(3.00)
//    arg(2.3)
//    arg1()
//    TypeOfDoc("Изображение")
//    Scale("Fahrengeit")
//    Weather(20)
//    ViewerAge(10)
//}
//// Задание 1: "Определение сезона"
////Напишите функцию, которая на основе номера месяца распечатывает сезон года. Номера месяцев начинаются с единицы.
//
//fun monthCount (monthCount: Int) {
//    when (monthCount) {
//        12 -> println("Winter")
//        1, 2, 12 -> println("Winter")
//        in 3..5 -> println("Spring")
//        in 6..8 -> println("Summer")
//        in 9..11 -> println("Fall")
//    }
//}
//
////Задание 2: "Расчет возраста питомца"
////Создайте функцию, которая преобразует возраст собаки в "человеческие" годы. До 2 лет каждый год собаки равен 10.5 человеческим годам, после - каждый год равен 4 человеческим годам. Результат распечатай в консоль.
//fun DogAgeCount(DogAgeCount: Int) {
//    if (DogAgeCount < 2) {
//        DogAgeCount * 10.5
//    } else {
//        DogAgeCount * 4.0
//    }
//}
//
////Задание 3: "Определение способа перемещения"
////Напишите функцию, которая печатает в консоль, какой способ перемещения лучше использовать, исходя из длины маршрута. Если маршрут до 1 км - "пешком", до 5 км - "велосипед", иначе - "автотранспорт".
//
//fun RoadDistance (arg: Double) {
//    if (arg < 1.00) {
//        println("Иди пешком!")
//    } else if(arg in 1..5) {
//        println("Возьми велосипед!")
//    } else {
//        println("Используй автотранспорт")
//    }
//}
//
////Задание 4: "Расчет бонусных баллов"
////Клиенты интернет-магазина получают бонусные баллы за покупки. Напишите функцию, которая принимает сумму покупки и печатает в консоль количество бонусных баллов: 2 балла за каждые 100 рублей при сумме покупки до 1000 рублей и 3 балла за каждые 100 рублей при сумме свыше этого.
//
//fun Bonus (arg1: Double) {
//    if(arg1 in 100..1000  && arg1 % 100 == 0) {
//        (arg1 / 100) * 2
//    } else if
//}
//
////Задание 5: "Определение типа документа"
////В системе хранения документов каждый файл имеет расширение. Напишите функцию, которая на основе расширения файла печатает в консоль его тип: "Текстовый документ", "Изображение", "Таблица" или "Неизвестный тип".
//fun DocType (TypeOfDoc: String) {
//    if (TypeOfDoc = "Текстовый документ") {
//        println("Текстовый документ")
//    } else if (TypeOfDoc = "Изображение") {
//        println("Изображение")
//    } else if(TypeOfDoc = "Таблица") {
//        println("Таблица")
//    } else {
//        println("Неизвестный тип")
//    }
//}
//
////Задание 6: "Конвертация температуры"
////Создайте функцию, которая конвертирует температуру из градусов Цельсия в Фаренгейты и наоборот в зависимости от указанной единицы измерения (C/F). Единицу измерения нужно передать вторым аргументом функции. Несколько аргументов передаются через запятую. Распечатай в консоль результат конвертации с добавлением единицы измерения. Чтобы добавить единицу измерения после результата используй функцию печати без переноса строки print("C") или print("F").
//
//fun Temperature (Temperature: Double, Scale: String) {
//    if(Scale == "Celsius") {
//        Temperature = (Temperature * (9/5)) + 32
//        println(Temperature)print("F")
//    } else if(Scale == "Fahrenheit") {
//        Temperature = (Temperature - 32) * (5/9)
//        println(Temperature)print("C")
//    } else {
//        println("Error")
//    }
//}
//
////Задание 7: "Подбор одежды по погоде"
////Напишите функцию, которая на основе температуры воздуха рекомендует тип одежды: "куртка и шапка" при температуре ниже +10, "ветровка" от +10 до +18 градусов включительно и "футболка и шорты" при температуре выше +18 градусов. При температурах ниже -30 и выше +35 рекомендуйте не выходить из дома.
//
//fun clothesForWeather(Weather: Int) {
//    when (Weather) {
//        in -30..10 -> println("Куртка и шапка")
//        in 10..18 -> println("Ветровка")
//        in 18..35 -> println("футболка и шорты")
//        <-30 -> println("Очень холодно, не выходи из дома")
//        > 35 -> println("Очень жарко, не выходи из дома")
//    }
//}
//
////Задание 8: "Выбор фильма по возрасту"
////Кинотеатр предлагает фильмы разных возрастных категорий. Напишите функцию, которая принимает возраст зрителя и возвращает доступные для него категории фильмов: "детские" (от 0 до 9), "подростковые" (от 10 до 18), "18+" для остальных.
//fun Age(ViewerAge: Int) {
//    if(ViewerAge in 0..9) {
//        println("Детские")
//    } else if(ViewerAge in 10..18) {
//        println("Подростковые")
//    } else {
//        println("18+")
//    }
//}